llm/glm_52/b200/bench/bench_random_low.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=0, dataset_name='random', dataset_path='/data/bbuf/kda-pilot/llm/sharegpt/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='zai-org/GLM-5.2-FP8', served_model_name=None, tokenizer=None, num_prompts=1, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=8, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file='glm_52/b200/bench/random_low.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=0, dataset_name='random', dataset_path='/data/bbuf/kda-pilot/llm/sharegpt/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='zai-org/GLM-5.2-FP8', served_model_name=None, tokenizer=None, num_prompts=1, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=8, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file='glm_52/b200/bench/random_low.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 38
#Output tokens: 4
Starting warmup with 0 sequences...
Warmup completed with 0 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 1         
Successful requests:                     1         
Benchmark duration (s):                  6.92      
Total input tokens:                      38        
Total input text tokens:                 38        
Total generated tokens:                  4         
Total generated tokens (retokenized):    4         
Request throughput (req/s):              0.14      
Input token throughput (tok/s):          5.49      
Output token throughput (tok/s):         0.58      
Peak output token throughput (tok/s):    1.00      
Peak concurrent requests:                1         
Total token throughput (tok/s):          6.07      
Concurrency:                             1.00      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   6911.58   
Median E2E Latency (ms):                 6911.58   
P90 E2E Latency (ms):                    6911.58   
P95 E2E Latency (ms):                    6911.58   
P99 E2E Latency (ms):                    6911.58   
---------------Time to First Token----------------
Mean TTFT (ms):                          3774.32   
Median TTFT (ms):                        3774.32   
P90 TTFT (ms):                           3774.32   
P95 TTFT (ms):                           3774.32   
P99 TTFT (ms):                           3774.32   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          1045.75   
Median TPOT (ms):                        1045.75   
P90 TPOT (ms):                           1045.75   
P95 TPOT (ms):                           1045.75   
P99 TPOT (ms):                           1045.75   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           1045.75   
Median ITL (ms):                         782.37    
P90 ITL (ms):                            1414.49   
P95 ITL (ms):                            1493.50   
P99 ITL (ms):                            1556.71   
Max ITL (ms):                            1572.52   
==================================================